var lang_arrays = {
    ru: {"Донецкая область":["Авдеевка","Артёмовск","Волноваха","Горловка","Дзержинск","Дебальцево","Димитров","Доброполье","Докучаевск","Донецк","Дружковка","Енакиево","Ждановка","Зугрэс","Кировское","Краматорск","Красноармейск","Красный Лиман","Константиновка","Мариуполь","Макеевка","Новогродовка","Майорск","Селидово","Славянск","Снежное","Соледар","Торез","Угледар","Харцызск","Шахтёрск","Ясиноватая"],"Кировоградская область":["Александрия","Бобринец","Гайворон","Долинская","Знаменка","Кировоград","Малая Виска","Новомиргород","Новоукраинка","Светловодск"],"Луганская область":["Александровск","Алмазная","Алчевск","Антрацит","Артёмовск","Брянка","Вахрушево","Горное","Зимогорье","Золотое","Зоринск","Краснодон","Краснопартизанск","Красный Луч","Лисичанск","Луганск","Лутугино","Миусинск","Молодогвардейск","Новодружеск","Новопсков","Первомайск","Перевальск","Петровское","Попасная","Приволье","Ровеньки","Рубежное","Сватово","Свердловск","Северодонецк","Старобельск","Стаханов","Суходольск","Счастье","Теплогорск"],"Автономная Республика Крым":["Алупка","Алушта","Армянск","Бахчисарай","Белогорск","Джанкой","Евпатория","Керчь","Красноперекопск","Саки","Севастополь","Симферополь","Старый Крым","Судак","Феодосия","Щёлкино","Ялта"],"Одесская область":["Ананьев","Арциз","Балта","Белгород-Днестровский","Болград","Измаил","Ильичёвск","Килия","Кодыма","Котовск","Одесса","Татарбунары","Теплодар","Южное"],"Житомирская область":["Андрушёвка","Барановка","Бердичев","Житомир","Коростень","Коростышев","Малин","Новоград-Волынский","Овруч","Радомышль"],"Днепропетровская область":["Апостолово","Верхнеднепровск","Вольногорск","Днепродзержинск","Днепропетровск","Жёлтые Воды","Кривой Рог","Марганец","Никополь","Новомосковск","Орджоникидзе","Павлоград","Перещепино","Першотравенск","Подгородное","Пятихатки","Синельниково","Терновка"],"Сумская область":["Ахтырка","Белополье","Бурынь","Глухов","Кролевец","Конотоп","Лебедин","Путивль","Ромны","Середина-Буда","Сумы","Тростянец","Шостка"],"Харьковская область":["Балаклея","Барвенково","Богодухов","Валки","Великий Бурлук","Волчанск","Дергачи","Змиев","Изюм","Красноград","Купянск","Лозовая","Люботин","Мерефа","Первомайский","Харьков","Чугуев"],"Винницкая область":["Бар","Бершадь","Винница","Гайсин","Жмеринка","Казатин","Калиновка","Ладыжин","Могилёв-Подольский","Немиров","Погребище","Тульчин","Хмельник","Шаргород","Ямполь"],"Черниговская область":["Бахмач","Бобровица","Борзна","Городня","Десна","Ичня","Корюковка","Мена","Нежин","Новгород-Северский","Носовка","Прилуки","Седнев","Семёновка","Чернигов","Щорс"],"Николаевская область":["Баштанка","Вознесенск","Николаев","Новая Одесса","Новый Буг","Очаков","Первомайск","Снигирёвка","Южноукраинск"],
        "Киевская область":[
            "Белая Церковь",
            "Березань",
            "Богуслав",
            "Борисполь",
            "Боярка",
            "Бровары",
            "Буча",
            "Васильков",
            "Вишнёвое",
            "Вышгород",
            "Ирпень",
            "Кагарлык",
            "Киев",
            "Мироновка",
            "Обухов",
            "Переяслав-Хмельницкий",
            "Припять",
            "Ржищев",
            "Сквира",
            "Славутич",
            "Тараща",
            "Тетиев",
            "Узин",
            "Украинка",
            "Фастов",
            "Чернобыль",
            "Яготин"],
        "Львовская область":["Белз","Бобрка","Борислав","Броды","Буск","Великие Мосты","Глиняны","Городок","Добромиль","Дрогобыч","Дубляны","Жидачов","Жолква","Золочев","Каменка-Бугская","Львов","Мостиска","Николаев","Новый Роздол","Перемышляны","Пустомыты","Рава-Русская","Радехов","Рудки","Самбор","Сколе","Сокаль","Старый Самбор","Стрый","Трускавец","Угнев","Хыров","Червоноград","Яворов"],
        "Запорожская область":["Бердянск","Васильевка","Вольнянск","Гуляйполе","Днепрорудное","Запорожье","Каменка-Днепровская","Мелитополь","Молочанск","Орехов","Пологи","Приморск","Токмак","Энергодар"],"Закарпатская область":["Берегово","Виноградов","Иршава","Мукачево","Перечин","Рахов","Свалява","Тячев","Ужгород","Хуст","Чоп"],"Тернопольская область":["Бережаны","Борщёв","Бучач","Залещики","Збараж","Зборов","Кременец","Лановцы","Монастыриска","Подволочиск","Подгайцы","Почаев","Скалат","Тернополь","Теребовля","Чортков","Шумск"],"Ровенская область":["Березне","Дубно","Дубровица","Здолбунов","Корец","Костополь","Кузнецовск","Острог","Радивилов","Ровно","Сарны"],"Волынская область":["Берестечко","Владимир-Волынский","Горохов","Камень-Каширский","Киверцы","Ковель","Луцк","Любомль","Нововолынск","Рожище","Устилуг"],"Херсонская область":["Берислав","Геническ","Голая Пристань","Каховка","Новая Каховка","Скадовск","Таврийск","Херсон","Цюрупинск"],"Ивано-Франковская область":["Болехов","Бурштын","Галич","Городенка","Долина","Ивано-Франковск","Калуш","Коломыя","Косов","Надворная","Рогатин","Снятын","Тысменица","Тлумач","Яремче"],"Черновицкая область":["Вашковцы","Вижница","Герца","Заставна","Кицмань","Новоднестровск","Новоселица","Сокиряны","Сторожинец","Хотин","Черновцы"],"Черкасская область":["Ватутино","Городище","Жашков","Звенигородка","Золотоноша","Каменка","Канев","Корсунь-Шевченковский","Монастырище","Смела","Тальное","Умань","Христиновка","Черкассы","Чигирин","Шпола"],"Хмельницкая область":["Волочиск","Городок","Деражня","Дунаевцы","Изяслав","Каменец-Подольский","Красилов","Нетешин","Полонное","Славута","Староконстантинов","Хмельницкий","Шепетовка"],"Полтавская область":["Гадяч","Глобино","Гребёнка","Зеньков","Карловка","Кременчуг","Кобеляки","Комсомольск","Лохвица","Лубны","Миргород","Пирятин","Полтава","Хорол","Червонозаводское"]}
    ,ua: { "Донецька область": [ "Авдіївка", "Артемівськ", "Волноваха", "Горлівка", "Дзержинськ", "Дебальцеве", "Димитров", "Добропілля", "Докучаєвськ", "Донецьк", "Дружківка" , "Єнакієве", "Жданівка", "Зугрес", "Кіровське", "Краматорськ", "Красноармійськ", "Червоний Лиман", "Костянтинівка", "Маріуполь", "Макіївка", "Новогродівка", "майорських", "Селидове", "Слов'янськ", "Сніжне", "Соледар", "Торез", "Вугледар", "Харцизьк", "Шахтарськ", "Ясинувата"], "Кіровоградська область": [ "Олександрія", "Бобринець" , "Гайворон", "Долинська", "Знам'янка", "Кіровоград", "Мала Виска", "Новомиргород", "Новоукраїнка", "Світловодськ"], "Луганська обла ть ": [" Олександрівськ "," Алмазна "," Алчевськ "," Антрацит "," Артемівськ "," Брянка "," Вахрушеве "," Гірське "," Зимогір'я "," Золоте "," Зоринськ "," Краснодон "," Червонопартизанськ "," Красний Луч "," Лисичанськ "," Луганськ "," Лутугине "," Міусинськ "," Молодогвардійськ "," Новодружеськ "," Новопсков "," Первомайськ "," Перевальськ "," Петрівське " , "Попасна", "Привілля", "Ровеньки", "Рубіжне", "Сватове", "Свердловськ", "Сєвєродонецьк", "Старобільськ", "Стаханов", "Суходільськ", "Щастя", "Теплогірськ"], "Автономна Республіка Крим": [ "Алупка", "Алушта", "Армянськ", "Бахчисарай", "Білогірськ", "Джанкой", "Євпаторія", "Керч", "Красноперекопс "," Саки "," Севастополь "," Сімферополь "," Старий Крим "," Судак "," Феодосія "," Щолкіно "," Ялта "]," Одеська область ": [" Ананьїв "," Арциз ", "Балта", "Білгород-Дністровський", "Болград", "Ізмаїл", "Іллічівськ", "Кілія", "Кодима", "Котовськ", "Одеса", "Татарбунари", "Теплодар", "Південне"] , "Житомирська область": [ "Андрушівка", "Баранівка", "Бердичів", "Житомир", "Коростень", "Коростишів", "Малин", "Новоград-Волинський", "Овруч", "Радомишль"], "Дніпропетровська область": [ "Апостолово", "Верхньодніпровськ", "Вольногорськ", "Дніпродзержинськ", "Дніпропетровськ", "Жовті Води", "Кривий Ріг", "Марганець", "Нікополь", "Новомосковськ", "Орджонікідзе", "Павлоград", "Перещепине", "Першотравенськ", "Підгородне", "П'ятихатки", "Синельникове", "Тернівка"], "Сумська область": [ "Охтирка", "Білопілля", "Буринь" , "Глухів", "Кролевець", "Конотоп", "Лебедин", "Путивль", "Ромни", "Середина-Буда", "Суми", "Тростянець", "Шостка"], "Харківська область": [ "Балаклея", "Барвінкове", "Богодухів", "Валки", "Великий Бурлук", "Вовчанськ", "Дергачі", "Зміїв", "Ізюм", "Красноград", "Куп'янськ", "Лозова", " Люботин "," Мерефа "," Первомайський "," Харків "," Чугуїв "]," Вінницька область ": [" Бар "," Бершадь "," Вінниця "," Гайсин "," Жмеринка "," Козятин ", "Калинівка", "Ладижин", "Могилів-Под Ольскій "," Немирів "," Погребище "," Тульчин "," Хмільник "," Шаргород "," Ямпіль "]," Чернігівська область ": [" Бахмач "," Бобровиця "," Борзна "," Городня ", "Десна", "Ічня", "Корюківка", "Мена", "Ніжин", "Новгород-Сіверський", "Носівка", "Прилуки", "Седнів", "Семенівка", "Чернігів", "Щорс"] , "Миколаївська область": [ "Баштанка", "Вознесенськ", "Миколаїв", "Нова Одеса", "Новий Буг", "Очаків", "Первомайськ", "Снігурівка", "Южноукраїнськ"], "Київська область" : [ "Біла Церква", "Березань", "Богуслав", "Бориспіль", "Боярка", "Бровари", "Буча", "Васильків", "Вишневе", "Вишгород", "Ірпінь", "Кагарлик" , "Київ", "Миронівка", "Обухів", "Переяслава лав-Хмельницький "," Прип'ять "," Ржищів "," Сквира "," Славутич "," Тараща "," Тетіїв "," Узин "," Українка "," Фастів "," Чорнобиль "," Яготин "], "Львівська область": [ "Белз", "Бібрка", "Борислав", "Броди", "Буськ", "Великі Мости", "Глиняни", "Городок", "Добромиль", "Дрогобич", "Дубляни" , "Жидачів", "Жовква", "Золочів", "Кам'янка-Бузька", "Львів", "Мостиська", "Миколаїв", "Новий Розділ", "Перемишляни", "Пустомити", "Рава-Руська", "Радехів", "Рудки", "Самбір", "Сколе", "Сокаль", "Старий Самбір", "Стрий", "Трускавець", "Угнів", "Хирів", "Червоноград", "Яворів"], "Запорізька область": [ "Бердянськ", "Василівка", "Вільнянськ", "Гуляйполе", "Дні рорудное "," Запоріжжя "," Кам'янка-Дніпровська "," Мелітополь "," Молочанськ "," Орєхов "," Пологи "," Приморськ "," Токмак "," Енергодар "]," Закарпатська область ": [" Берегово "," Виноградів "," Іршава "," Мукачево "," Перечин "," Рахів "," Свалява "," Тячів "," Ужгород "," Хуст "," Чоп "]," Тернопільська область ": [" Бережани "," Борщів "," Бучач "," Заліщики "," Збараж "," Зборів "," Кременець "," Ланівці "," Монастириська "," Підволочиськ "," Підгайці "," Почаїв "," Скалат " , "Тернопіль", "Теребовля", "Чортків", "Шумськ"], "Рівненська область": [ "Березне", "Дубно", "Дубровиця", "Здолбунів", "Корець", "Костопіль", "Кузнецовськ "," Острог "," Радивилів "," Рівне "," Сар ни "]," Волинська область ": [" Берестечко "," Володимир-Волинський "," Горохів "," Камінь-Каширський "," Ківерці "," Ковель "," Луцьк "," Любомль "," Нововолинськ ", "Рожище", "Устилуг"], "Херсонська область": [ "Берислав", "Генічеськ", "Гола Пристань", "Каховка", "Нова Каховка", "Скадовськ", "Таврійськ", "Херсон", " Цюрупинськ "]," Івано-Франківська область ": [" Болехів "," Бурштин "," Галич "," Городенка "," Долина "," Івано-Франківськ "," Калуш "," Коломия "," Косів ", "Надвірна", "Рогатин", "Снятин", "Тисмениця", "Тлумач", "Яремче"], "Чернівецька область": [ "Вашківці", "Вижниця", "Герца", "Заставна", "Кіцмань" , "Новодністровськ", "Новоселиця", "С Киря "," Сторожинець "," Хотин "," Чернівці "]," Черкаська область ": [" Ватутіне "," Городище "," Жашків "," Звенигородка "," Золотоноша "," Кам'янка "," Канів ", "Корсунь-Шевченківський", "Монастирище", "Сміла", "Тальне", "Умань", "Христинівка", "Черкаси", "Чигирин", "Шпола"], "Хмельницька область": [ "Волочиськ", " Городок "," Деражня "," Дунаївці "," Ізяслав "," Кам'янець-Подільський "," Красилів "," Нетішин "," Полонне"," Славута "," Старокостянтинів "," Хмельницький "," Шепетівка "]," Полтавська область ": [" Гадяч "," Глобино "," Гребінка "," Зіньків "," Карлівка "," Кременчук "," Кобеляки "," Комсомольськ "," Лохвиця "," Лубни "," Миргород "," Пирятин "," Полтава "," Хорол "," Червонозаводське "]}

    ,en: {
        "Donetsk region": [
            "Avdeevka",
            "Artemovsk",
            "Volnovaha",
            "Gorlovka",
            "Dzerzhinsk",
            "Debaltsevo",
            "Dimitrov",
            "Dobropolye", "Dokuchaevsk", "Donetsk", "Druzhkovka" , "Yenakiyevo", "Zhdanovka", "Zugres", "Kirovskoe", "Kramatorsk", "Krasnoarmeysk", "Red Liman", "Konstantinovka", "Mariupol", "Makeevka", "Novogrodovka", "Mallorsk", "Selidovo", "Slavyansk", "Snowy", "Soledar", "Torez", "Ugledar", "Khartsyzsk", "Shakhtorsk", "Yasinovataya"],
        "Kirovograd region": ["Alexandria", "Bobrinets" , "Gayvoron", "Dolinskaya", "Znamenka", "Kirovograd", "Malaya Viska", "Novomirgorod", "Novoukrainka", "Svetlovodsk"],
        "Lugansk region ": ["Aleksandrovsk", "Almaznaya", "Alchevsk", "Anthracite", "Artemovsk", "Bryanka", "Vakhrushevo", "Mountainous", "Zimogorye", "Golden", "Zorinsk", "Krasnodon", "Krasnopartizansk", "Krasny Luch", "Lisichansk", "Lugansk", "Lutugino", "Miussinsk", "Molodogvardeysk", "Novodruzhesk", "Novopskov", "Pervomaisk", "Perevalsk", "Petrovskoye", "Popovnaya", "Privolye", "Rovenky", "Rubezhnoye", "Svatovo", "Sverdlovsk", "Severodonetsk", "Starobelsk", "Stakhanov", "Sukhodolsk", "Happiness", "Teplogorsk"],
        "Autonomous Republic of Crimea": ["Alupka", "Alushta", "Armyansk", "Bakhchisaray", "Belogorsk", "Dzhankoy", "Evpatoria", "Kerch", "Krasnoperekops","Saki","Sevastopol "," Simferopol "," Old Crimea "," Sudak "," Feodosia "," Shchelkino "," Yalta "],
        " Odessa region ": [" Ananiev "," Artsz ", "Balta", "Belgorod-Dnestrovsky", "Bolgrad", "Izmail", "Illichivsk", "Kiliya", "Kodyma", "Kotovsk", "Odessa", "Tatarbunary", "Teplodar", "Southern"] ,
        "Zhytomyr region": ["Andrushevka", "Baranovka", "Berdichev", "Zhitomir", "Korosten", "Korostyshev", "Malin", "Novograd-Volynsky", "Ovruch", "Radomyshl"],
        "Dnepropetrovsk region": ["Apostolovo", "Verkhnedneprovsk", "Volnogorsk", "Dneprodzerzhinsk", "Dnepropetrovsk", "Yellow Waters", "Krivoy Rog", "Marganets", "Nikopol", "Novomoskovsk", "Ordzhonikidze", "Pavlograd", "Pereshchepino", "Pershotravensk", "Suburban", "Pyatikhatki", "Sinelnikovo", "Ternovka"],
        "Sumy region": ["Akhtyrka", "Belopole", "Buryn" , "Glukhov", "Krolevets", "Konotop", "Lebedin", "Putivl", "Romny", "Mid-Buda", "Sumy", "Trostyanets", "Shostka"],
        "Kharkov region": [ "Balakleya", "Barvenkovo", "Bogodukhov", "Valki", "Veliky Burluk", "Volchansk", "Dergachi","Zmiev", "Izyum", "Krasnograd", "Kupyansk", "Lozovaya", "Lubotin", "Merefa", "Pervomaisky", "Kharkiv", "Chuguev"],
        "Vinnytsia region": ["Bar", "Bershad", "Vinnytsia", "Gaisin", "Zhmerynka", "Kazatin", "Kalinovka", "Ladyzhin", "Mogilev-Pod", "Nemyriv", "Pogrebishche", "Tulchin", "Khmilnik", "Shargorod", "Yampol"],
        "Chernihiv region": ["Bakhmach", "Bobrovitsa", "Borzna", "Gorodnya", "Desna", "Ichnya", "Koryukovka", "Mena", "Nizhin", "Novgorod-Seversky", "Nosovka", "Priluki", "Sednev", "Semenovka", "Chernigov", "Shchors"] ,
        "Mykolaiv region": ["Bashtanka", "Voznesensk", "Nikolaev", "New Odessa", "New Bug", "Ochakov", "Pervomaisk", "Snigirevka", "Yuzhnoukrainsk"],
        "Kiev region" : [
            "White Church",
            "Berezan",
            "Boguslav",
            "Borispol",
            "Boyarka",
            "Brovary",
            "Bucha",
            "Vasilkov",
            "Cherry",
            "Vyshgorod",
            "Irpen",
            "Kagarlyk" ,
            "Kiev",
            "Mironovka",
            "Obukhov",
            "Pereyaslav-Khmelnitsky",
            "Pripyat",
            "Rzhyshchiv",
            "Skvira",
            "Slavutich",
            "Tarashcha",
            "Tetiev",
            "Uzin",
            "Ukrainka",
            "Fastiv",
            "Chernobyl",
            "Yagotin"],
        "Lviv region": ["Belz", "Bobrka", "Borislav", "Brody", "Busk", "Great Bridges", "Glinyany", "Gorodok", "Dobromil", "Drogobych", "Dublyany" , "Zhidachov", "Zholkva", "Zolochiv", "Kamenka-Bugskaya", "Lviv", "Mostyska", "Nikolaev", "New Rosdol", "Peremyshlyany", "Pustomyty", "Rava-Russkaya", "Radekhov", "Rudki", "Sambor", "Skole", "Sokal", "Old Sambor", "Stryi", "Truskavets", "Ugnev", "Khyrov", "Chervonograd", "Yavorov"],
        "Zaporozhye region": [
            "Berdyansk", "Vasilievka", "Volnyansk", "Gulyaypole", "Dneprorudnoe", "Zaporozhye", "Kamenka-Dneprovskaya", "Melitopol", "Molochansk", "Orekhov", "Pogol", "Primorsk", "Tokmak", "Energodar"],
        "Zakarpatskaya Oblast": ["Beregovo","Vinogradov", "Irshava", "Mukachevo", "Perechin", "Rakhiv", "Svalyava", "Tyachiv", "Uzhhorod", "Khust", "Chop"],
        "Ternopil region": [ "Borschany", "Borshchev", "Buchach", "Zaleshchiki", "Zbarazh", "Zborov", "Kremenets", "Lanovtsy", "Monastyryska", "Podvolochisk", "Podgaytsy", "Pochaev", "Skalat", "Ternopil", "Terebovlya", "Chortkov", "Shumsk"], "Rivne region": ["Berezne", "Dubno", "Dubrovitsa", "Zdolbunov", "Korets", "Kostopol", "Kuznetsovsk "," Ostrog "," Radivilov "," Exactly "," Sar"],
        "Volyn region": ["Berestechko", "Vladimir-Volynsky", "Gorokhov", "Kamen-Kashirsky", "Kivertsy", "Kovel", "Lutsk", "Lyuboml","Novovolynsk", "Rozhishche", "Ustilug"],
        "Kherson region": ["Berislav", "Genichesk", "Naked Wharf", "Kakhovka", "New Kakhovka", "Skadovsk", "Tavriysk", "Kherson", " Tsurupinsk "],
        "Ivano-Frankivsk region": ["Bolekhov "," Burshtyn "," Galich "," Gorodenka "," Valley "," Ivano-Frankivsk "," Kalush "," Kolomiya "," Kosov ", "Nadvornaya", "Rogatin", "Snyatyn", "Tysmenitsa", "Tlumach", "Yaremche"],
        "Chernivtsi region": ["Vashkovtsy", "Vizhnitsa", "Hertz", "Zastavna", "Kitsman" , "Novodnestrovsk", "Novoselitsa", "With Karyans "," Storozhinets "," Khotyn "," Chernivtsi"],
        "Cherkasy region ": ["Vatutino", "Gorodische", "Zhashkiv", "Zvenigorodka", "Zolotonosha", "Kamenka", "Kanev", "Korsun-Shevchenkovsky", "Monastery", "Smila", "Talnoye", "Uman", "Khristinovka", "Cherkassy", "​​Chyhyryn", "Shpola"],
        "Khmelnytsky Region": ["Volochisk", "Gorodok"," Derazhnya "," Dunayevtsy "," Izyaslav "," Kamenetz-Podolsky "," Krasilov "," Netishin "," Polonne"," Slavuta "," Starokonstantinov "," Khmelnitsky "," Shepetivka "],
        "Poltava region": ["Gadyach", "Globino", "Grebenka", "Zenkov", "Karlovka", "Kremenchug", "Kobelyaki", "Komsomolsk", "Lokhvitsa", "Lubny", "Mirgorod", "Piryatin", "Poltava", "Khorol", "Chervonozavodsky"]
    }}

var fs = require('fs');
var settingsArray = createSettingsArray('en');

fs.writeFile('./citys/setting_cities_array.json',JSON.stringify(settingsArray))
var obj = {};

obj.ru = landing('ru');
obj.en = landing('en');
obj.ua = landing('ua');

var landingArray = getLandingArray();
fs.writeFile('./citys/localization_cities_array.json',JSON.stringify(landingArray))


function createSettingsArray(lang) {
    var i = 0;
    var regions = [];
    for (var key in lang_arrays[lang]) {

        var cities = lang_arrays[lang][key].map(function(el){
           el = el.trim().replace(' ','_');
            return {
               title: el.toUpperCase(),
               key: el.toLowerCase()
           }
        });
        key = key.trim().replace(' ','_');
        regions.push({
            title: key.toUpperCase(),
            key: key.toLowerCase(),
            cities: cities
        });
        i++
    }
    return regions;
}

function landing(lang) {
    var array = [];
    for(var key in lang_arrays[lang]) {
        array.push({
            key: key,
            value: lang_arrays[lang][key]
        })
    }
    return array;
}

var land_array_ = {
    ru: [
        {
            key: 'odessa region',
            value: ['odessa', 'yaski']
        }
    ]
};


function getLandingArray(array) {
    var landing_array = {};
    obj.ru.forEach(function (item, i) {
        var key = obj.en[i].key.trim().replace(' ','_').toUpperCase();

        landing_array[key] = {
            ru: obj.ru[i].key.trim().toLowerCase(),
            en: obj.en[i].key.trim().toLowerCase(),
            ua: obj.ua[i].key.trim().toLowerCase()
        };

        obj.ru[i].value.forEach(function (item_, j) {
            var key = obj.en[i].value[j].trim().replace(' ','_').toUpperCase();

            landing_array[key] = {
                ru: obj.ru[i].value[j].trim().toLowerCase(),
                en: obj.en[i].value[j].trim().toLowerCase(),
                ua: obj.ua[i].value[j].trim().toLowerCase()
            };
        });



    });
    return landing_array;
}


var landing_array_ = {
    ODESSA_REGION: {
        ru: 'одесская область',
        ua: 'одеська область',
        en: 'odessa region'
    },
    ODESSA: {
        ru: 'одесса',
        ua: 'одеса',
        en: 'odessa'
    }
};


var array_1 = [
    {
        title: 'ODESSA_REGION',
        key: 'odessa_region',
        cities: [
            {
                title: 'ODESSA',
                key: 'odessa'
            },
            {
                title: 'YASKI',
                key: 'yaski'
            }
        ]
    }
];
